In [1]:
import os
import pymysql
import pandas as pd
password = os.environ.get('MYSQL_PASSWORD')

In [2]:
try:
    con = pymysql.connect(
                            host='localhost',
                            user='root',
                            password=password,
                            charset='utf8mb4'
                            )
    print("Connection to the database was successful!")
except pymysql.Error as e:
    print(f"An error occurred while connecting to the database: {e}")

Connection to the database was successful!

In [3]:
# Some useful functions: 


# calling this function makes life easy and just need to pass the name of the database I want to make a query on
# It serves like USE keyword in SQL

def connector (database, password=password, host='localhost', 
               user='root', charset='utf8mb4',):
    
    conn = pymysql.connect(
                        host=host,
                        user=user,
                        password=password,
                        charset=charset, 
                        database=database)
    
    return conn

# to get my tables' names in the datanase

def table_names (database):
    
    con = connector(database)
    
    query = "SELECT table_name FROM information_schema.tables WHERE table_schema='{}';".format(database)

    # Execute the query and store the results in a Pandas DataFrame
    tables = pd.read_sql_query(query, con)

    # Print the list of tables
    return tables

def delete_database(database):
    conn = connector(database=None)
    cursor = conn.cursor()

    # Replace <database_name> with the name of the database you want to delete
    database_name = database

    # Execute the DROP DATABASE SQL command
    cursor.execute(f"DROP DATABASE {database_name}")

    # Commit the transaction
    conn.commit()

    # Close the connection
    conn.close()

def database_creator(database_name):
    
    conn = connector(database=None)
    
    # Create a cursor object
    cursor = conn.cursor()

    # Execute the CREATE DATABASE SQL command
    cursor.execute(f"CREATE DATABASE {database_name}")

    # Commit the transaction
    conn.commit()

    # Close the connection
    conn.close()

def insert_data_to_table(database_name, table_name, schema, data):
    # Connect to the database
    conn = connector(database_name)

    # Create a cursor object
    cursor = conn.cursor()

    # Create the table with the given schema if it does not exist
    cursor.execute(f"CREATE TABLE IF NOT EXISTS {table_name} ({schema})")

    # Truncate the table to remove any existing data
    cursor.execute(f"TRUNCATE TABLE {table_name}")

    # Insert data into the table
    for row in data:
        placeholders = ",".join(["%s" for _ in range(len(row))])
        query = f"INSERT INTO {table_name} VALUES ({placeholders})"
        cursor.execute(query, row)

    # Commit the transaction to save the changes
    conn.commit()

    # Close the connection
    conn.close()

In [88]:
# How to get the names of all the databases in my MySQL server 

# I can use the cursor object from my database connection to execute SQL commands and retrieve information 
# about my databases. Here's an example of how I can use the **SHOW DATABASES** SQL command to retrieve the 
# names of all databases in my MySQL server using my connector function:


# Create a database connection
conn = connector(database='sql_store')

# Create a cursor object
cursor = conn.cursor()

# Execute the SHOW DATABASES command
cursor.execute('SHOW DATABASES')

# Fetch all the results as a list of tuples
results = cursor.fetchall()

# Print the names of all databases in the MySQL server
for row in results:
    print(row[0])

# Close the cursor and connection
cursor.close()
conn.close()

Leetcode_Q_1378
Leetcode_Q_1683
Leetcode_Q_1693
Leetcode_Q_1741
Leetcode_Q_1757
Leetcode_Q_2356
information_schema
invoicing
mysql
performance_schema
sql_hr
sql_inventory
sql_invoicing
sql_store
sys

# Leetcode Question 1757: Recyclable and Low Fat Products

In [13]:
database_creator ('Leetcode_Q_1757')

In [ ]:
# here is the SQL Schema for the question 1757 on Leetcode - database 

Create table If Not Exists Products (product_id int, low_fats ENUM('Y', 'N'), recyclable ENUM('Y','N'))
Truncate table Products
insert into Products (product_id, low_fats, recyclable) values ('0', 'Y', 'N')
insert into Products (product_id, low_fats, recyclable) values ('1', 'Y', 'Y')
insert into Products (product_id, low_fats, recyclable) values ('2', 'N', 'Y')
insert into Products (product_id, low_fats, recyclable) values ('3', 'Y', 'Y')
insert into Products (product_id, low_fats, recyclable) values ('4', 'N', 'N')

In [16]:
schema = "product_id int, low_fats ENUM('Y', 'N'), recyclable ENUM('Y', 'N')"
data = [("0", "Y", "N"), ("1", "Y", "Y"), ("2", "N", "Y"), ("3", "Y", "Y"), ("4", "N", "N")]

insert_data_to_table("Leetcode_Q_1757", "Products", schema, data)

In [55]:
print (table_names('Leetcode_Q_1757'))

  TABLE_NAME
0   Products

In [19]:
con = connector('Leetcode_Q_1757')

In [20]:
pd.read_sql("SELECT *\
            FROM Products p", con)

   product_id low_fats recyclable
0           0        Y          N
1           1        Y          Y
2           2        N          Y
3           3        Y          Y
4           4        N          N

In [21]:
pd.read_sql("SELECT p.product_id\
            FROM Products p\
            WHERE low_fats = 'Y' AND recyclable = 'Y'", con)

   product_id
0           1
1           3

# Leetcode Question 1378: Replace Employee ID With The Unique Identifier

In [ ]:
Create table If Not Exists Employees (id int, name varchar(20))
Create table If Not Exists EmployeeUNI (id int, unique_id int)
Truncate table Employees
insert into Employees (id, name) values ('1', 'Alice')
insert into Employees (id, name) values ('7', 'Bob')
insert into Employees (id, name) values ('11', 'Meir')
insert into Employees (id, name) values ('90', 'Winston')
insert into Employees (id, name) values ('3', 'Jonathan')
Truncate table EmployeeUNI
insert into EmployeeUNI (id, unique_id) values ('3', '1')
insert into EmployeeUNI (id, unique_id) values ('11', '2')
insert into EmployeeUNI (id, unique_id) values ('90', '3')

In [ ]:
database_creator('Leetcode_Q_1378')

In [34]:
schema = "id int, name varchar(20)"
data = [('1', 'Alice'), ('7', 'Bob'), ('11', 'Meir'), ('90', 'Winston'), ('3', 'Jonathan')]

insert_data_to_table("Leetcode_Q_1378", "Employees", schema, data)

In [35]:
schema = "id int, unique_id int"
data = [('3', '1'), ('11', '2'), ('90', '3')]

insert_data_to_table("Leetcode_Q_1378", "EmployeeUNI", schema, data)

In [56]:
print (table_names('Leetcode_Q_1378'))

    TABLE_NAME
0  EmployeeUNI
1    Employees

In [38]:
con = connector('Leetcode_Q_1378')
pd.read_sql("SELECT *\
            FROM Employees", con)

   id      name
0   1     Alice
1   7       Bob
2  11      Meir
3  90   Winston
4   3  Jonathan

In [39]:
pd.read_sql("SELECT *\
            FROM EmployeeUNI", con)

   id  unique_id
0   3          1
1  11          2
2  90          3

In [49]:
pd.read_sql("""
SELECT 
    euni.unique_id, 
    e.name
FROM Employees e
LEFT JOIN EmployeeUNI euni
    USING (id)
""", con)

   unique_id      name
0        NaN     Alice
1        NaN       Bob
2        2.0      Meir
3        3.0   Winston
4        1.0  Jonathan

# Leetcode Question 1683: Invalid Tweets

In [ ]:
Create table If Not Exists Tweets(tweet_id int, content varchar(50))
Truncate table Tweets
insert into Tweets (tweet_id, content) values ('1', 'Vote for Biden')
insert into Tweets (tweet_id, content) values ('2', 'Let us make America great again!')

In [6]:
database_creator('Leetcode_Q_1683')

In [7]:
schema = "tweet_id int, content varchar(50)"
data = [('1', "Vote for Biden"), ('2', "Let us make America great again!")]

insert_data_to_table("Leetcode_Q_1683", "Tweets", schema, data)

In [8]:
print(table_names('Leetcode_Q_1683'))

  TABLE_NAME
0     Tweets

In [9]:
con = connector('Leetcode_Q_1683')

In [10]:
pd.read_sql("""
SELECT *
FROM Tweets
""", con)

   tweet_id                           content
0         1                    Vote for Biden
1         2  Let us make America great again!

In [15]:
pd.read_sql("""
SELECT tweet_id
FROM Tweets
WHERE LENGTH(content) > 15
""", con)

   tweet_id
0         2

# Leetcode Question 1741: Find Total Time Spent by Each Employee

In [ ]:
Create table If Not Exists Employees(emp_id int, event_day date, in_time int, out_time int)
Truncate table Employees
insert into Employees (emp_id, event_day, in_time, out_time) values ('1', '2020-11-28', '4', '32')
insert into Employees (emp_id, event_day, in_time, out_time) values ('1', '2020-11-28', '55', '200')
insert into Employees (emp_id, event_day, in_time, out_time) values ('1', '2020-12-3', '1', '42')
insert into Employees (emp_id, event_day, in_time, out_time) values ('2', '2020-11-28', '3', '33')
insert into Employees (emp_id, event_day, in_time, out_time) values ('2', '2020-12-9', '47', '74')

In [17]:
database_creator('Leetcode_Q_1741')

In [18]:
schema = "emp_id int, event_day date, in_time int, out_time int"
data = [('1', '2020-11-28', '4', '32'), ('1', '2020-11-28', '55', '200'), ('1', '2020-12-3', '1', '42'),
       ('2', '2020-11-28', '3', '33'), ('2', '2020-12-9', '47', '74')]

insert_data_to_table("Leetcode_Q_1741", "Employees", schema, data)

In [19]:
print(table_names('Leetcode_Q_1741'))

  TABLE_NAME
0  Employees

In [20]:
con = connector('Leetcode_Q_1741')

In [21]:
pd.read_sql("""
SELECT *
FROM Employees
""", con)

   emp_id   event_day  in_time  out_time
0       1  2020-11-28        4        32
1       1  2020-11-28       55       200
2       1  2020-12-03        1        42
3       2  2020-11-28        3        33
4       2  2020-12-09       47        74

In [30]:
pd.read_sql("""
SELECT 
    event_day AS day,
    emp_id, 
    SUM(out_time - in_time) AS total_time
FROM Employees
GROUP BY event_day, emp_id
ORDER BY event_day
""", con)

          day  emp_id  total_time
0  2020-11-28       1       173.0
1  2020-11-28       2        30.0
2  2020-12-03       1        41.0
3  2020-12-09       2        27.0

# Leetcode Question 2356: Number of Unique Subjects Taught by Each Teacher

In [ ]:
Create table If Not Exists Teacher (teacher_id int, subject_id int, dept_id int)
Truncate table Teacher
insert into Teacher (teacher_id, subject_id, dept_id) values ('1', '2', '3')
insert into Teacher (teacher_id, subject_id, dept_id) values ('1', '2', '4')
insert into Teacher (teacher_id, subject_id, dept_id) values ('1', '3', '3')
insert into Teacher (teacher_id, subject_id, dept_id) values ('2', '1', '1')
insert into Teacher (teacher_id, subject_id, dept_id) values ('2', '2', '1')
insert into Teacher (teacher_id, subject_id, dept_id) values ('2', '3', '1')
insert into Teacher (teacher_id, subject_id, dept_id) values ('2', '4', '1')

In [31]:
database_creator('Leetcode_Q_2356')

In [32]:
schema = "teacher_id int, subject_id int, dept_id int"
data = [('1', '2', '3'),
       ('1', '2', '4'),
       ('1', '3', '3'),
       ('2', '1', '1'),
       ('2', '2', '1'),
       ('2', '3', '1'),
       ('2', '4', '1')]

insert_data_to_table("Leetcode_Q_2356", "Teacher", schema, data)

In [33]:
con = connector('Leetcode_Q_2356')

In [34]:
pd.read_sql("""
SELECT *
FROM Teacher
""", con)

   teacher_id  subject_id  dept_id
0           1           2        3
1           1           2        4
2           1           3        3
3           2           1        1
4           2           2        1
5           2           3        1
6           2           4        1

In [57]:
pd.read_sql("""
SELECT 
    teacher_id,
    COUNT(DISTINCT subject_id) AS cnt
FROM Teacher
GROUP BY teacher_id
""", con)

   teacher_id  cnt
0           1    2
1           2    4

# Leetcode Question 1693: Daily Leads and Partners

In [ ]:
Create table If Not Exists DailySales(date_id date, make_name varchar(20), lead_id int, partner_id int)
Truncate table DailySales
insert into DailySales (date_id, make_name, lead_id, partner_id) values ('2020-12-8', 'toyota', '0', '1')
insert into DailySales (date_id, make_name, lead_id, partner_id) values ('2020-12-8', 'toyota', '1', '0')
insert into DailySales (date_id, make_name, lead_id, partner_id) values ('2020-12-8', 'toyota', '1', '2')
insert into DailySales (date_id, make_name, lead_id, partner_id) values ('2020-12-7', 'toyota', '0', '2')
insert into DailySales (date_id, make_name, lead_id, partner_id) values ('2020-12-7', 'toyota', '0', '1')
insert into DailySales (date_id, make_name, lead_id, partner_id) values ('2020-12-8', 'honda', '1', '2')
insert into DailySales (date_id, make_name, lead_id, partner_id) values ('2020-12-8', 'honda', '2', '1')
insert into DailySales (date_id, make_name, lead_id, partner_id) values ('2020-12-7', 'honda', '0', '1')
insert into DailySales (date_id, make_name, lead_id, partner_id) values ('2020-12-7', 'honda', '1', '2')
insert into DailySales (date_id, make_name, lead_id, partner_id) values ('2020-12-7', 'honda', '2', '1')

In [59]:
database_creator('Leetcode_Q_1693')

In [60]:
schema = "date_id date, make_name varchar(20), lead_id int, partner_id int"
data = [ ('2020-12-8', 'toyota', '0', '1'),
         ('2020-12-8', 'toyota', '1', '0'), 
         ('2020-12-8', 'toyota', '1', '2'), 
         ('2020-12-7', 'toyota', '0', '2'),
         ('2020-12-7', 'toyota', '0', '1'),
         ('2020-12-8', 'honda', '1', '2'),
         ('2020-12-8', 'honda', '2', '1'),
         ('2020-12-7', 'honda', '0', '1'),
         ('2020-12-7', 'honda', '1', '2'),
         ('2020-12-7', 'honda', '2', '1')]

insert_data_to_table("Leetcode_Q_1693", "DailySales", schema, data)

In [61]:
con = connector('Leetcode_Q_1693')

In [62]:
pd.read_sql("""
SELECT *
FROM DailySales
""", con)

      date_id make_name  lead_id  partner_id
0  2020-12-08    toyota        0           1
1  2020-12-08    toyota        1           0
2  2020-12-08    toyota        1           2
3  2020-12-07    toyota        0           2
4  2020-12-07    toyota        0           1
5  2020-12-08     honda        1           2
6  2020-12-08     honda        2           1
7  2020-12-07     honda        0           1
8  2020-12-07     honda        1           2
9  2020-12-07     honda        2           1

In [87]:
pd.read_sql("""
SELECT 
    date_id,
    make_name,
    COUNT(DISTINCT lead_id) AS unique_leads,
    COUNT(DISTINCT partner_id) AS unique_partners
FROM DailySales
GROUP BY date_id, make_name
ORDER BY make_name DESC, date_id DESC
""", con)

      date_id make_name  unique_leads  unique_partners
0  2020-12-08    toyota             2                3
1  2020-12-07    toyota             1                2
2  2020-12-08     honda             2                2
3  2020-12-07     honda             3                2

# Leetcode Question 1795: Rearrange Products Table